import M from './messages/messages';

const monasteryImgData = [
    { src: '/app/assets/images/monasteries/Axtala.jpg', name: 'Axtala', desc: `Ախթալայի վանական համալիր, Ախտալա, Մարիամ Աննայի վանք, Մեյրամխանա, Աղնձանանք, X դարում հիմնադրված պարսպապատ վանական համալիր, գտնվում է Հայաստանի Հանրապետության Լոռու մարզի Ախթալա գյուղում՝ Երևանից 185 կմ հյուսիս։ Ախթալայի վանական համալիրը Հայաստանի այն քաղկեդոնական վանքերից է, որի կառուցումը համընկնում է Հայաստանի Վերածնության շրջանի հետ։ Ախթալայի վանական հուշարձանախմբում ներդաշնակ միահյուսվել են հայկական, վրացական ու բյուզանդական ճարտարապետության տարրերը։

    Միջնադարում վանքը հայտնի էր որպես Պղնձահանքի վանք։ Կիրակոս Գանձակեցին իր «Հայոց Պատմությունում» հիշատակում է, որ իշխան Իվանե Զաքարյանը մահացավ 1241 թ և նրա դին ամփոփվեց Պղնձահանքում, որը Իվանեն նախկինում խլել էր հայերից և դարձրել վրացական (այսինքն՝ ուղղափառ) եկեղեցի։ Դարձնելով ուղղափառ եկեղեցի, ուղղափառություն ընդունած Իվանե Զաքարյանը այն վերակառուցեց և անվանեց Ախթալա։ Ըստ Գանձակեցու, նույն եկեղեցում է ամփոփված նաև Իվանեի որդի, իշխան Ավագը (մահ, 1250 թ Բջնիում)։
    
    Սուրբ Աստվածածին եկեղեցու պատերը նկարազարդված են հոյակապ, հրաշալի պահպանված որմնանկարներով։ Որմնանկարները կատարվել են XIII դարում, երբ եկեղեցին վերափոխվեց քաղկեդոնականի։ Որմնանկարներն իրենց գունային լուծումներով մոտենում են բյուզանդականին, սակայն թեմաների ընտրությունը զուտ հայկական է։
    
    Ներկայումս Ախթալայի վանքն ունի ուխտագնացության օրեր՝ սեպտեմբերի 20-21։`},
    { src: '/app/assets/images/monasteries/Dadivanq.jpg', name: 'Dadivanq', desc: `Դադիվանք, հայկական առաքելական միջնադարյան վանական համալիր Արցախի Հանրապետության Շահումյանի շրջանի Դադիվանք գյուղում՝ Դադիվան լեռան լանջին՝ Թարթառ գետի ձախ ափին։ Պատմականորեն եղել է Մեծ Կվենք գավառի հոգևոր առաջնորդարանը։ Կոչվել է նաև Խութավանք, որովհետև կառուցվել է խութի (բլրակի) վրա։

    Ավանդության համաձայն՝ եկեղեցին հիմնվել է Քրիստոսի առաքյալներից Թադևոսի հետևորդ Դադեի կողմից 1-ին դարում։ Դադիվանքի վերանորոգման շրջանակներում իրականացված պեղումների ընթացքում՝ 2007 թվականի հուլիսի 21-ին, վանական համալիրի եկեղեցիներից մեկի խորանի տակ գտնվել են սուրբ Դադե առաքյալի մասունքները։ Գտնվել է նաև մեկ այլ դամբարան, որը հայկական քրիստոնեական ավանդույթներին բնորոշ չէ. այնտեղ թաղված մարդը նստած է աթոռին, վերջինս այժմ Ստեփանակերտի թանգարանում է։ 9-րդ դարում կառուցվել են վանական համալիրի առաջին կառույցները՝ ի դեմս սուրբ Դադիի միանավ վանքի։ 1145 թվականին համալիրն ավերել են սելջուկները, սակայն 1170 թվականին այն վերանորոգվել է:`},
    { src: '/app/assets/images/monasteries/Gayane.jpg', name: 'Gayane', desc: `Սուրբ Գայանե եկեղեցին ներդաշնակ համաչափություններով, տպավորիչ ինտերիերով քառամույթ գմբեթավոր բազիլիկ է, որի Ավագ խորանի տակ գտնվում է սրբուհու՝ հարավարևելյան ավանդատնից մուտքով թաղածածկ դամբարանը:

    17-րդ դարում եկեղեցին եղել է կիսավեր ու լքված: 17-րդ դարի պատմիչ Առաքել Դավրիժեցին գրում է, որ Սուրբ Գայանե եկեղեցու միայն պատերն ու գմբեթակիր մույթերն են կանգուն եղել: Փիլիպոս Ա Աղբակեցին 1652 թվականին հիմնովին վերակառուցել է եկեղեցին, վերականգնել նրա ծածկը և գմբեթը: Միաժամանակ Սուրբ Գայանե եկեղեցու հիմքերը ստորգետնյա ջրերից պաշտպանելու համար վանքի հարավային պարսպից դեպի դաշտ ջրահեռացման համակարգ են ստեղծել, որպեսզի ջրերը նաև ոռոգման նպատակով օգտագործվեն:
    
    1688 թվականին Եղիազար Ա Այնթապցին կառուցել է վանքի միաբանության շենքերը, պարիսպը, Ս. Գայանե եկեղեցուն արևմտյան կողմից կցել եռակամար գավիթ-սրահ, նրա հարավային և հյուսիսային ծայրերին պատարագամատույց սեղաններով Պողոս և Պետրոս առաքյալներին նվիրված մատուռներ շինել: Գավիթ-սրահը հետագայում ծառայել է որպես կաթողիկոսների տապանատուն:
    
    1764 թվականին Սիմեոն Ա Երևանցին Սուրբ Գայանե եկեղեցու տարածքում կառուցել է ստորգետնյա խոշոր սառցատուն՝ վանքի մթերքները պահելու համար: Գևորգ Դ Կոստանդնուպոլսեցու գահակալության տարիներին (1866–82) եկեղեցու վանահայր Վահան Բաստամյանցը նորոգել է վանքը, կառուցել արևմտյան կամարակապ դարպասը, վանահոր և միաբանների բնակելի շենքերը, դպրոց, որտեղ ինքը դասավանդել է, հիմնել է տպարան և հրատարակել «Դպրոց» ամսագիրը:
    
    1910 թվականին Նոր Նախիջևանի հայ համայնքը սև գրանիտից տապանաքար է բերել սուրբ Գայանեի գերեզմանի համար: 1959 թվականին Սուրբ Գայանե եկեղեցին նորոգվել է, եկեղեցու ներսը մաքրվել է սվաղից, հատակը սալարկվել, տարածքը բարեկարգվել, բակում կառուցվել է մատաղատուն, աղբյուր (ճարտ.՝ Ռ. Իսրայելյան):
    
    1960 թվականին վանքի տարածքում Մայր աթոռի՝ 1920 թվականից հետո թաղված միաբանների գերեզմանների վրա դրվել են մարմարե սալիկներով տապանաքարեր: 1976 թվականին Սուրբ Գայանե եկեղեցու շուրջը դարերի ընթացքում կուտակված լիցքը հեռացվել է, պատերի մեջ շաղախ է ներարկվել, և քայքայված քարերը փոխարինվել են նորերով:`},
    { src: '/app/assets/images/monasteries/Haxpat.jpg', name: 'Haxpat', desc: `Վանքի առաջին՝ Սուրբ Նշան եկեղեցին և միաբանությունը 976 թվականին հիմնադրել են Աշոտ Գ թագավորը և նրա կին Խոսրովանույշը՝ իրենց որդիներ Կյուրիկեի (Գուրգենի) և Սմբատի արևշատության համար: Հիմնադիր վանահայրն է եղել Սիմեոնը, որը Տիրանուն երեցի հետ ղեկավարել է եկեղեցու շինարարությունը (ավարտը՝ 991 թվականին) և հիմնել վանքի հոգևոր դպրոցը: Սանահինի վանքից և այլ վայրերից հրավիրվել են գիտնական և ուսուցիչ վանականներ, և շուտով Կյուրիկյան թագավորության այս երկու վանքերում միաբանների ընդհանուր թիվը հասել է 500-ի: 11-րդ դարի 1-ին քառորդում Սուրբ Նշան եկեղեցու հյուսիսային պատին կից կառուցվել են երկու մատուռ-տապանատներ (1005-1020), Սուրբ Գրիգոր եկեղեցին (1005) և վանքի նախնական պարիսպը: 11-րդ դարում կառուցվել է նաև գրատունը, որի փայտե ծածկը հետագայում վերաշինվել է քարով։

    1064 թվականին Տաշիր-Ձորագետի թագավոր Կյուրիկե Ա Բագրատունին, ճանաչելով սելջուկ թուրքերի գերիշխանությունը, կարողացել է կիսանկախ վիճակում պահպանել թագավորությունը և նրա հոգևոր կենտրոնները: Նույն ժամանակ նա եպիսկոպոսական աթոռը Սանահինից տեղափոխել է Հաղպատ, որտեղ 1081 թվականին օժանդակել է Անի-Շիրակի եպիսկոպոս Բարսեղին՝ օծվելու կաթողիկոսական տեղապահ (1105-1113 թվականներին՝ Ամենայն հայոց կաթողիկոս Բարսեղ Ա Անեցի): Հաղպատում Կյուրիկյան թագավորության եկեղեցական թեմի առաջնորդ է կարգվել Սարգիս եպիսկոպոսը: 1105 թվականին Ղըզըլ ամիրան հարձակվել, ավերել և կողոպտել է մի շարք բնակավայրեր և վանքեր, այդ թվում՝ Սանահինի և Հաղպատի միաբանությունները:`},
    { src: '/app/assets/images/monasteries/Hayravanq.jpg', name: 'Hayravanq', desc: `Հայրավանք, Հայր Հովհաննու վանք, Մարդաղավնյաց վանք, ՀՀ Գեղարքունիքի մարզի Հայրավանք գյուղի հյուսիսարևելյան կողմում, Սևանա լճի ափին։ Հայրավանքի Սբ. Ստեփանոս եկեղեցին կառուցվել է 9-րդ դարում, ունի քառակոնք կենտրոնագմբեթ հորինվածք և համարվում է հայկական ճարտարապետության եզակի նմուշներից, կառուցված է բազալտից, իսկ կամարները, ութանիստ թմբուկով գմբեթը՝ սրբատաշ տուֆից։

    1211 թվականին եղբայրներ Հովհաննես և Ներսես վարդապետները նորոգել են եկեղեցին ու կառուցել երկսյուն, երդիկավոր ութանիստ, շթաքարեզարդ գմբեթով գավիթ։
    
    Հայրավանքի պարսպապատ փոքրիկ բակում կան 16-րդ տապանաքարեր ու խաչքարեր, իսկ պարսպից դուրս խցերի և տնտեսական շենքերի ավերակներն են։ Հայրավանքը գործել է մինչև 19-րդ դարը։ 1980-ական թվականներին վանքը նորոգվել է, եկեղեցու գմբեթը՝ վերակառուցվել։`},
    { src: '/app/assets/images/monasteries/Makaravanq.jpg', name: 'Makaravanq', desc: `Մակարավանք, Ագռավավանք, 13-րդ դարի հայկական վանական համալիր Հայաստանի Տավուշի մարզում, Աչաջուր գյուղից 3 կմ հարավ-արևմուտք, Պայտաթափ լեռան լանջին։ Մակարավանքի համալիրն իր զարդաքանդակների ինքնատիպությամբ, հարստությամբ և բազմազանությամբ դասվում է Աղթամարի, Բղենո-Նորավանքի, Գանձասարի շարքին և կարևոր տեղ գրավում հայ ճարտարապետության մեջ։

    Այժմ Մակարավանքի վանահայրն է արժանապատիվ Տ. Արշավիր քահանա Ասատրյանը, ում կողմից ամեն կիրակի և տերունի օրերին Սուրբ և Անմահ Պատարագ է մատուցվում։ Վանքը երբեմն կոչվել է նաև Ագռավավանք`},
    { src: '/app/assets/images/monasteries/Oshakan.jpg', name: 'Oshakan', desc: `Օշական, գյուղ Արագածոտնի մարզում՝ Աշտարակ քաղաքից 3 կմ հարավ-արևմուտք։ Նախկինում ունեցել է Հուշական, Ուշագան, Ուշական, Օշագան անվանումները։ Համայնքի մակերեսը կազմում է 16,96 կմ², իսկ բնակչությունը՝ 5962 մարդ։ Համայնքը սահմանակից է Ոսկեվազ, Աշտարակ, Սասունիկ, Դաշտ համայնքների վարչական տարածքներին։`},
    { src: '/app/assets/images/monasteries/Sanahin.jpg', name: 'Sanahin', desc:`Սանահինի վանքային համալիր, միջնադարյան հոգևոր, մշակութային և գիտակրթական նշանավոր կենտրոն Մեծ Հայքի Գուգարք նահանգի Տաշիրք գավառում, այժմ՝ Հայաստանի Լոռու մարզի Ալավերդի քաղաքի Սանահին թաղամասում (նախկին Սանահին գյուղ), Դեբեդ գետի աջափնյա բարձրադիր սարավանդի վրա:

    Ըստ ժողովրդական ստուգաբանության՝ «Սանահին» նշանակում է սա նրանից (Հաղպատից) հին, նաև՝ սան-հին, հին կաթսա։
    
    Հաղպատի վանքի հետ միասին հանդիսանում է ՅՈՒՆԵՍԿՕ–ի համաշխարհային ժառանգության օբյեկտ։`},
    { src: '/app/assets/images/monasteries/Saxmosavanq.jpg', name: 'Saxmosavanq', desc:`Սաղմոսավանք, հայկական առաքելական վանական համալիր Հայաստանի Արագածոտնի մարզի Սաղմոսավան գյուղում: Կառուցվել է 13-րդ դարում Այրարատյան կողմնակալության կողմնակալ Վաչե Ա Վաչուտյանի և իր իշխանական ընտանիքի կողմից։ Սաղմոսավանքի վանական համալիրը գտնվում է Հայաստանի Արագածոտնի մարզի Սաղմոսավան գյուղում, Քասախ գետի ձախ, բարձրադիր գեղատեսիլ հատվածում, Երևանից 37 կմ հեռավորության վրա:

    Սաղմոսավանք բառի հիմքում սաղմոսն է: Սաղմոսը հոգևոր երգն է: Աշխարհում միակ վանքն է, որ այստեղ հնչած սաղմոսների անունով Սաղմոսավանք է կոչվել: Եվ իսկապես, վանական այս համալիրը հրաշալի ակուստիկա ունի:`},
    { src: '/app/assets/images/monasteries/Tatev.jpg', name: 'Tatev', desc:`Տաթևի վանքը IX դարի պատմական հուշարձան է, հայ ճարտարապետության բացառիկ նմուշ, հնագույն հոգևոր կենտրոններից մեկը, ինչպես նաև միջնադարյան Հայաստանի ամենամեծ համալսարանը:

    Վանքի վերականգնումը, վանական կյանքի վերածնունդը և վանքի կրթական նշանակության վերականգնումը «Տաթևի Վերածնունդ» նախագծի հիմնական նպատակներից է, որի մի մասն է կազմում նաև «ՏաԹևեր» ճոպանուղին: Ձեր առջև կբացվեն՝
    անառիկ ժայռերի վրա բարձրացող հզոր պարիսպները,
    հնագույն ձիթհանը՝ աղացաքարերով,
    ճոճվող գավազանը՝ բացառիկ միջնադարյան կառույց,
    եվրոպացի վարպետների հնագույն որմնանկարները:`},
    { src: '/app/assets/images/monasteries/Texer.jpg', name: 'Texer', desc: `Գտնվում է Բյուրականից հյուսիս, Տեղեր գյուղում, անդնդախոր կիրճի աջափնյա եզրին։ Տեղերի վանքի մասին պատմիչները չեն հիշատակում։ Համաձայն գավթի մուտքի ճակատակալ քարի արձանագրության՝ կառուցել է Արարատյան կողմնակալության կողմնակալ իշխանաց-իշխան Վաչե Ա Վաչուտյանի կինը՝ Մամախաթունը, ճարտարապետն է եղել Աղբայրիկ վարդպետը։ Բաղկացած է Սուրբ Աստվածածին եկեղեցուց և գավթից։`},
    { src: '/app/assets/images/monasteries/XorVirap.jpg', name: 'XorVirap', desc: `Խոր Վիրապ, Խոր վիրապի վանք, ճարտարապետական հուշարձան, 17-րդ դարի վանք-ամրոց Մեծ Հայքի Այրարատ նահանգի Ոստան Հայոց գավառում, Արաքս գետի ձախ կողմում, Փոքր Վեդի գյուղի մոտակայքում, պատմական Արտաշատ քաղաքի բլուրներից մեկի վրա (այժմ՝ Հայաստանի Արարատի մարզի Լուսառատ գյուղից մոտ 1 կմ հյուսիս-արևմուտք)։ Եղել է Հայոց հանրահայտ ուխտատեղիներից՝ կապված Գրիգոր Լուսավորչի անվան հետ։`},
];

const hitoryImgData = [
    { src: '/app/assets/images/history/Amberd.jpg',  name: 'Amberd', desc: `Ամբերդ, Ամպիր, Անբերդ, Համբերդ, Հանբերդ, Ղըզղալա, միջնադարյան նախկին բերդաքաղաք և ամրոց։ Կառուցվել է (X դար) Մեծ Հայքի Այրարատ նահանգի Արագածոտն գավառում՝ Բյուրական գյուղից 7 կմ հյուսիս՝ (Արագած լեռան հարավային լանջին) Արքաշեն և Ամբերդ գետերի միացման տեղում: Ներկայումս գտնվում է Հայաստանի Արագածոտնի մարզում՝ Արագած լեռան հյուսիս-արևելյան լանջին՝ եռանկյունաձև հրվանդանին, ծովի մակերևույթից 2300 մետր բարձրության վրա, Երևանից 55 կիլոմետր դեպի հյուսիս, Բյուրական գյուղից՝ 5-7 կմ. հյուսիս-արևմուտք:`},
    { src: '/app/assets/images/history/AshotErkat.jpg', name: 'AshotErkat', desc: `Ամրոցը գտնվում է Դիլիջան քաղաքից մոտ 25 կմ դեպի հյուսիս արևելք, Աղստև գետի աջ ափին, ուղղաձիգ բարձրացող ժայռի գագաթին։ Կառուցվել է արաբական տիրապետության ժամանակաշրջանում։ Այն Հայաստանի անառիկ ամրոցներից մեկն է։

    Լեռան անցանելի հատվածները ամրացված են ամուր պարսպապատերով, որոնք ունեն բրգաձև աշտարակներ, պատերի մեջ՝ կլոր, փոքր անցքեր։ Պարսպապատերը սև քարից են, ամուր կրաշաղախով։ Սև գույնի պատճառով հետագայում օտար նվաճողները այն կոչել են Ղարա ղալա այսինքն Սև բերդ, իսկ ԽՍՀՄ տարիներին սկսել են կիրառել Кара Кала անունը: Ամրոցը կրկնահարկ է, սանդղավանդակի ձևով, առաջին հարկը բավական ընդհարձակ է, հյուսիսից բարձրանում է մի այլ քարաժայռ, որի վրա տեղավորված է ամրոցի երկրորդ աստիճանը՝ միջնաբերդը, այն ամրացված է պարսպապատերով, արևելյան կողմից ունի առանձին մուտք։ Միջնաբերդը զբաղեցնում է փոքր տարածություն։ Ամրոցի երկու մասերում էլ նկատվում են կառույցների հիմնապատերը։
    
    Պատմական աղբյուրներում Մանթաշաբերդը միշտ հիշատակվում է Կայեն բերդի (Աղջկա բերդ) հետ միասին, որից կարելի է ենթադրել, որ այն կառուցվել է 10-րդ դարի առաջին քառորդում։`},
    { src: '/app/assets/images/history/LoriBerd.jpg', name: 'LoriBerd'},
    { src: '/app/assets/images/history/MexriBerd.jpg', name: 'MexriBerd'},
    { src: '/app/assets/images/history/Smbataberd.jpg', name: 'Smbataberd'}
];

const natureImgData = [
    { src: '/app/assets/images/nature/Shake.jpg', name: 'Shake', desc: `Շաքիի ջրվեժ, Շաքե, Շաքի, ջրվեժ Հայաստանի Սյունիքի մարզում, Շաքի գետի վրա, Որոտանի կիրճում, Շաքի գյուղից ներքև, 1 կմ հարավ, Սիսիանից 3 կմ դեպի հյուսիս-արևմուտք։ Բարձրությունը 15-17 մ է։

    Ջրվեժի տեղանքը իրենից ներկայացնում է խորը կիրճ՝ հարուստ ժայռերով և քարայրներով։ Դրանցում հայտնաբերվել են մարդու գործունեության հետքեր, ինչպես նաև մոխիր, որը թվագրվում է պալեոլիթի ժամանակաշրջանին։ Գեղատեսիլ է։ Գետի ջրի մեծ մասը տարված է Շաքիի ՀԷԿ, ջրվեժով թափնում է նրա փոքր մասը։
    
    Այն գրանցված է Հայաստանի Հանրապետության Բնապահպանության նախարարության բնության պետական հուշարձանների ցանկում։ Բնության պետական հուշարձանների ցանկում ներառվել է 2008 թվականի օգոստոսի 14-ին ընդունված «Հայաստանի Հանրապետության բնության հուշարձանների ցանկը հաստատելու մասին» ՀՀ Կառավարության որոշման համաձայն։`},
    { src: '/app/assets/images/nature/Tondrak.jpg', name: 'Tondrak', desc: `Թոնդրակ, Թանղուրսւկ, Թանդուրեկ, Թանդուրեք, Թանդուրիկ, Թանդուրլու, Թենդուրեկ, Թոնդրիկ, Թոնդուրակ, Թոնդուրեկ, Թոնիր, Թոնրակ, Սունդերլիկ, Տանդուրեկ, Տենդյուրյուկ, լեոնագագաթ Թուրքիայում, Ծաղկանց լերնաշղթայում։ Անջրպետում է Արածանի ու Արաքս գետերը և կազմում ՝Ծաղկոան ու Կոգովիտ գավառների սահմանագիծը։ Բարձրություն 3542 մ։ Գործող հրաբուխ է, գագաթային մասը կոնաձև է և գոգավոր, բաժականմ աններս ընկած խառնարանով, որին այլազգիները տվել են Ջհաննամ Դարասի անունը։ Խառնարանի շըրջագիծը 2000, խորությունը 320 մ է, որտեղից մեծ ուժգնությամբ դուրս են ժայթքում բարձր ջերմություն ունեցող ծծմբային գազեր և գոլորշիներ։ Կազմըված է բազալտային, անդեզիտային և արախիանդեզիտային լավաներից։ Լանջերը տեղ֊տեղ զառիթափ, տեղ֊տեղ մեզմաթեք են, որոնց մի զգալի մասը ծածկված է հողմնահարված հրաբխային ապարներով։ Ունի հրաբխային ջինանյութեր ու ջերմուկներ։ Ջմեռը խիստ է, հզոր ձնածածկույթով, տարեկան տեղումներըճ 500—700 մմ։ Տիրապետում է լեռնատափաստանային և լեռնամարգադետնային բուսականութչունը։ Գրականության մեջ և քարտեզներում Թոնդրակից արևելք ցտնվող Խոոի գագաթը նույնացվում են։ Թոնդրակի հրաբուխը անցյալ ղարերում ուսումնասիրել է գերմանացի երկրաբան Հ. Աթիխը։`},
    { src: '/app/assets/images/nature/VanaNemrut.jpg', name: 'VanaNemrut', desc: `Նեմրութը (Սարակն) երիտասարդ բազմածին հրաբուխ է, որը գտնվում է Հայկական լեռնաշխարհում՝ Վանա լճի արևմտյան ափին: Բարձրությունը կազմում է 2935 մ, հիմքի շրջագիծը՝ մոտ 50 կմ: Հրաբխի գագաթը իրենից ներկայացնում է խոշոր կալդերա, որի մեջ լիճ է գոյացել: Գագաթից բացվում է հրաշալի տեսարան դեպի խառնարանը: Այն գտնվում է 2500 մ-ի վրա, որն ամենամեծն է ողջ Հայկական լենաշխարհում 8 կմ տրամագծով, որի արևմտյան մասում խառնարանային լճերն են 9 քառ. կմ մակերեսով, որոնցից փոքրի ջերմաստիճանն ավելի բարձր է: Խառնարանի պատերը կախված, զառիթափ ժայռերով են՝ միչև 300 մ բարձրությամբ, կազմված թթու կազմի լավաներից: Խառնարանից ու լանջերից դուրս են գալիս տաք գազեր, ջրեր և գոլորշիներ: Հարավ-արևելյան լանջերը զառիթափ են, արևմտյանը' զառիկող իջնում են դեպի Մշո դաշտ:`},
    { src: '/app/assets/images/nature/Aragats.jpg', name: 'Aragats'}

];

const getImages = (type) => {
    switch(type) {
        case M.monastery:
           return monasteryImgData;
        case M.history:
            return hitoryImgData;
        case M.nature:
            return natureImgData;
        default:
            return []
    }
}

export {getImages};