import React from 'react';
import PropTypes from 'prop-types';

import M from '../../Messages/messages';

class Details extends React.Component {

    static propTypes = {
        imgTitle: PropTypes.string.isRequired,
        imgDescription: PropTypes.string.isRequired,
        imagePath: PropTypes.string.isRequired
    }

    render() {
        const desc = `Հանրապետության հրապարակ[6][7], քաղաքի վարչական կենտրոնի գլխավոր ճարտարապետական համակառույցը, տոնակատարությունների, շքերթների և ժողովրդական հավաքույթների վայր, տրանսպորտային կարևոր հանգույց։ Ստեղծվել է ըստ Երևանի գլխավոր հատակագծի․ այն նախագծվել է ճարտարապետ Ալեքսանդր Թամանյանի կողմից 1924 թվականին[8]։ Հանրապետության հրապարակի հատակագիծը սեղանի և օվալի համադրություն է (մակերեսը՝ 3 հեկտար[1][9] կամ 3,5 հեկտար, համաձայն Google Earth-ի տարածքի չափման ֆունկցիայի)՝ տեղադրված քաղաքի հյուսիս-հարավ առանցքով։ Նրա ծավալատարածված հորինվածքն ընդգրկում է վարչական շենքեր՝ Կառավարական տունը (ճարտարապետ՝ Ալեքսանդր Թամանյան, ԽՍՀՄ պետական մրցանակ, 1942, հետմահու, նիստերի դահլիճի նախագիծը և շինության ավարտի ղեկավարումը՝ Գևորգ Թամանյանի), Կառավարական 2-րդ տունը (ճարտարապետներ՝ Սամվել Սաֆարյան, Վարազդատ Արևշատյան, նախագծման սկզբնական փուլում նաև՝ Ռաֆայել Իսրայելյան), Արհեստակցական միությունների շենքը, «Արմենիա» հյուրանոցը, թանգարանների շենքը (երեքն էլ՝ ճարտարապետներ՝ Մարկ Գրիգորյան, Էդուարդ Սարապյան, վերջինը՝ Ս. Ղազարյանի մասնակցությամբ)։ Համակառույցի գեղագիտական արտահայտչականությունը լրացնում է խոշոր ջրավազանն իր շատրվաններով, որը միաժամանակ մեղմացնում է հրապարակի միկրոկլիման։ Բոլոր շենքերը կառուցված են և երեսպատված սպիտակ (Կառավարական 2-րդ տունը, թանգարանների շենքը) և վարդագույն (մնացած շենքերը) երանգների ֆելզիտային տուֆով։ Կառավարական տունը հրապարակի առաջին կառույցն է, ավելի ուշ կառուցված Կառավարական 2-րդ տունը և հրապարակի հարավարևմտյան շենքերը ճարտարապետական ձևերի բնույթով, ընդհանուր բարձրությամբ, ուրվագծով, ծավալային շեշտերով, ճակատային քայլքի չափով ներդաշնակ են նրան, որով և պայմանավորված է Հանրապետության հրապարակի հորինվածքային և ոճային միասնությունը։ Հանրապետության հրապարակը հայ ճարտարապետության լավագույն անսամբլներից է։ 1971 թվականին Հանրապետության հրապարակի կառուցապատման հեղինակներն արժանացել են ՀԽՍՀ պետական մրցանակի։ Կառույցների մեծ մասի շինարարությունն ավարտին է հասցվել մինչև 1950 թվականը, իսկ վերջին շենքի՝ Ազգային պատկերասրահի կառուցումն ավարտվել է 1977 թվականին[3]։

        1940-1990 թվականներին կոչվել է Լենինի հրապարակ։ Հրապարակի հարավ-արևմուտքում մինչև 1991 թվականը կանգնած է եղել Լենինի արձանը (1940, քանդակագործ Սերգեյ Մերկուրով, ճարտարապետներ՝ Նատալյա Փարեմուզովա, Լևոն Վարդանով (Վարդանյան))։ Հայաստանի անկախացումից հետո արձանը հանվել է (պատվանդանն ապապամոնտաժվել է 1996 թվականին), հրապարակը՝ վերանվանվել[10]։ Հանրապետության հրապարակը բնութագրվել է որպես «քաղաքի ու Հայաստանի ամենակարևոր քաղաքացիական տարածքը», Երևանի «ճարտարապետական սեփականություն»[11] և «Երևանի ամենաակնառու ճարտարապետական համալիրը»[12]։ Գրող և ճանապարհորդ Դեերդո Հոլդինգը Հանրապետության հրապարակը կոչել է «20-րդ դարում աշխարհում կառուցված լավագույն կենտրոնական հրապարակներից մեկը»`
        return (
            <div className="detailsContainer">
                <div className='imgTitle'>
                    <span>IMG Title</span>
                </div>
                <div className='imgDesc'>
                    <span>{desc}</span>
                </div>
                <div className='imgContainer'>
                    <img src='/app/images/nature/Shake.jpg' />
                </div>
            </div>
        )
    }
}

export default Details;